let scores = 0;

let q1 = prompt("Выберите как меня зовут 1 - Саша, 2 - Егор, 3 - Никита");
if (q1 == '1'){
    scores = scores + 2 
} else {
    scores -= 2
}

alert(` ${scores} - результат `)

let q2 = prompt("Выберите как зовут моего преподователя 1 - Светлана, 2 - Егор, 3 - Печенье");
if (q2 == '1') {
    scores = scores + 2
} else {
    scores -= 2
}


alert(` ${scores} - результат `)
let q2 = prompt("Світовий океан поділено на основні частини – Тихий, Атлантичний, Індійський і Північний Льодовитий океани –. 1 - материками, 2 - островами, 3 -течіями, 4 - розломами");
if (q2 == '1') {
    scores = scores + 2
} else {
    scores -= 2
}


alert(` ${scores} - результат `)
let q2 = prompt("Про який субрегіон на політичній карті Азії образно кажуть, що там завжди пахне порохом і нафтою? 1 - Східну Азію, 2 - Південну Азію, 3 - Центральну Азію, 4 - Західну Азію");
if (q2 == '4') {
    scores = scores + 2
} else {
    scores -= 2
}


alert(` ${scores} - результат `)
let q2 = prompt("Який вид продукції вироблено в первинному секторі економіки? 1 - яйця курячі, 2 - паркет дубовий, 3 - тканину бавовняну, 4 - дріт алюмінієвий");
if (q2 == '1') {
    scores = scores + 2
} else {
    scores -= 2
}


alert(` ${scores} - результат `)
let q2 = prompt("Загострення глобальної продовольчої проблеми в окремих регіонах планети передусім є наслідком, 1 - енергетичної кризи, 2 - демографічного вибуху, 3 - екологічних проблем, 4 - загрози світової війни");
if (q2 == '2') {
    scores = scores + 2
} else {
    scores -= 2
}


alert(` ${scores} - результат `)
let q2 = prompt("Доберіть правильне пояснення подібності й відмінності двох річок: «...несе води в тому ж напрямку, що й Амазонка, але впадає в інший океан». 1 - одна річка головна, а друга – її притока, 2 - ці річки течуть на різних материках, 3 - повінь на цих річках у різні пори року, 4 - річки кілька разів змінюють характер течії");
if (q2 == '2') {
    scores = scores + 2
} else {
    scores -= 2
}


alert(` ${scores} - результат `)
let q2 = prompt("Гори Аппалачі нижчі за Кордильєри тому, що 1 - старіші за часом утворення, 2 - складені твердішими породами, 3 - багатші на корисні копалини, 4 - розташовані ближче до океану");
if (q2 == '1') {
    scores = scores + 2
} else {
    scores -= 2
}


alert(` ${scores} - результат `)
let q2 = prompt("Доповніть характеристику рослинності в зоні саван і рідколісся Австралії: «З віддаленням. від океану ліси переходять у рідколісся і савани із червоно-бурими ґрунтами. Поміж трав трапляються пляшкові дерева, 1 - уздовж мангрових заростей височать фінікові пальми», 2 - сосни й кедри утворюють вічнозелений верхній ярус», 3 - стовбури фікусів і пальм щільно переплетені ліанами», 4 - невисокі акації і казуарини, чагарники з евкаліптів»");
if (q2 == '4') {
    scores = scores + 2
} else {
    scores -= 2
}


alert(` ${scores} - результат `)
let q2 = prompt("Карпати мають пологі схили й згладжені вершини, тому що 1 - сформовані в герцинську епоху горотворення (палеозойська ера), 2 - зруйновані під час землетрусів наприкінці мезозойської ери, 3 - складені переважно осадовими породами, що легко руйнуються, 4 - розчленовані глибокими долинами, каньйонами, балками");
if (q2 == '3') {
    scores = scores + 2
} else {
    scores -= 2
}


alert(` ${scores} - результат `)
let q2 = prompt("Яка подія зумовила збільшення кількості іммігрантів в Україні? 1 - влаштування програміста з передмістя на роботу в Києві, 2 - переїзд родини з Херсонської області на проживання в Дніпро, 3 - приїзд представника української діаспори в Одесу на конференцію, 4 - переїзд підприємця з Білорусі на постійне проживання в Житомир");
if (q2 == '4') {
    scores = scores + 2
} else {
    scores -= 2
}


alert(` ${scores} - результат `)
let q2 = prompt("Корпорація Х у Німеччині відмовилася від утримання ІТ-підрозділу й передала виконання цієї роботи одній із компаній в Індії. Цей приклад аутсорсингових послуг підтверджує, що в Індії 1 - вищий рівень розвитку економіки, 2 - менші витрати на оплату праці, 3 - більший попит на такі послуги, 4 - нижчий рівень зайнятості населення");
if (q2 == '2') {
    scores = scores + 2
} else {
    scores -= 2
}


alert(` ${scores} - результат `)
let q2 = prompt("Розбудову інфраструктури гірськолижних баз в Україні супроводжує вирубування лісів, тому потрібно передбачити збільшення загрози 1 - масштабних лісових пожеж, 2 - танення гірських льодовиків, 3 - катастрофічних паводків, 4 - виверження грязьових вулканів");
if (q2 == '3') {
    scores = scores + 2
} else {
    scores -= 2
}


alert(` ${scores} - результат `)
